Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ64GS608.h
extern volatile AUXCON6BITS AUXCON6bits __attribute__((__sfr__));

#define PWMCON7 PWMCON7
extern volatile unsigned int  PWMCON7 __attribute__((__sfr__));
__extension__ typedef struct tagPWMCON7BITS {
  union {
    struct {
      unsigned IUE:1;
      unsigned XPRES:1;
      unsigned CAM:1;
      unsigned MTBS:1;
      unsigned :1;
      unsigned DTCP:1;
      unsigned DTC:2;
      unsigned MDCS:1;
      unsigned ITB:1;
      unsigned TRGIEN:1;
      unsigned CLIEN:1;
      unsigned FLTIEN:1;
      unsigned TRGSTAT:1;
      unsigned CLSTAT:1;
      unsigned FLTSTAT:1;
    };
    struct {
      unsigned :6;
      unsigned DTC0:1;
      unsigned DTC1:1;
    };
  };
} PWMCON7BITS;
extern volatile PWMCON7BITS PWMCON7bits __attribute__((__sfr__));

#define IOCON7 IOCON7
extern volatile unsigned int  IOCON7 __attribute__((__sfr__));
__extension__ typedef struct tagIOCON7BITS {
  union {
    struct {
      unsigned OSYNC:1;
      unsigned SWAP:1;
      unsigned CLDAT:2;
      unsigned FLTDAT:2;
      unsigned OVRDAT:2;
      unsigned OVRENL:1;
      unsigned OVRENH:1;
      unsigned PMOD:2;
      unsigned POLL:1;
      unsigned POLH:1;
      unsigned PENL:1;
      unsigned PENH:1;
    };
    struct {
      unsigned :2;
      unsigned CLDAT0:1;
      unsigned CLDAT1:1;
      unsigned FLTDAT0:1;
      unsigned FLTDAT1:1;
      unsigned OVRDAT0:1;
      unsigned OVRDAT1:1;
      unsigned :2;
      unsigned PMOD0:1;
      unsigned PMOD1:1;
    };
  };
} IOCON7BITS;
extern volatile IOCON7BITS IOCON7bits __attribute__((__sfr__));

#define FCLCON7 FCLCON7
extern volatile unsigned int  FCLCON7 __attribute__((__sfr__));
__extension__ typedef struct tagFCLCON7BITS {
  union {
    struct {
      unsigned FLTMOD:2;
      unsigned FLTPOL:1;
      unsigned FLTSRC:5;
      unsigned CLMOD:1;
      unsigned CLPOL:1;
      unsigned CLSRC:5;
      unsigned IFLTMOD:1;
    };
    struct {
      unsigned FLTMOD0:1;
      unsigned FLTMOD1:1;
      unsigned :1;
      unsigned FLTSRC0:1;
      unsigned FLTSRC1:1;
      unsigned FLTSRC2:1;
      unsigned FLTSRC3:1;
      unsigned FLTSRC4:1;
      unsigned :2;
      unsigned CLSRC0:1;
      unsigned CLSRC1:1;
      unsigned CLSRC2:1;
      unsigned CLSRC3:1;
      unsigned CLSRC4:1;
    };
  };
} FCLCON7BITS;
extern volatile FCLCON7BITS FCLCON7bits __attribute__((__sfr__));

#define PDC7 PDC7
extern volatile unsigned int  PDC7 __attribute__((__sfr__));
#define PHASE7 PHASE7
extern volatile unsigned int  PHASE7 __attribute__((__sfr__));
#define DTR7 DTR7
extern volatile unsigned int  DTR7 __attribute__((__sfr__));
#define ALTDTR7 ALTDTR7
extern volatile unsigned int  ALTDTR7 __attribute__((__sfr__));
#define SDC7 SDC7
extern volatile unsigned int  SDC7 __attribute__((__sfr__));
#define SPHASE7 SPHASE7
extern volatile unsigned int  SPHASE7 __attribute__((__sfr__));
#define TRIG7 TRIG7
extern volatile unsigned int  TRIG7 __attribute__((__sfr__));
__extension__ typedef struct tagTRIG7BITS {
  union {
    struct {
      unsigned :3;
      unsigned TRGCMP:13;
    };
    struct {
      unsigned :3;
      unsigned TRGCMP0:1;
      unsigned TRGCMP1:1;
      unsigned TRGCMP2:1;
      unsigned TRGCMP3:1;
      unsigned TRGCMP4:1;
      unsigned TRGCMP5:1;
      unsigned TRGCMP6:1;
      unsigned TRGCMP7:1;
      unsigned TRGCMP8:1;
      unsigned TRGCMP9:1;
      unsigned TRGCMP10:1;
      unsigned TRGCMP11:1;
      unsigned TRGCMP12:1;
    };
  };
} TRIG7BITS;
extern volatile TRIG7BITS TRIG7bits __attribute__((__sfr__));

#define TRGCON7 TRGCON7
extern volatile unsigned int  TRGCON7 __attribute__((__sfr__));
__extension__ typedef struct tagTRGCON7BITS {
  union {
    struct {
      unsigned TRGSTRT:6;
      unsigned :1;
      unsigned DTM:1;
      unsigned :4;
      unsigned TRGDIV:4;
    };
    struct {
      unsigned TRGSTRT0:1;
      unsigned TRGSTRT1:1;
      unsigned TRGSTRT2:1;
      unsigned TRGSTRT3:1;
      unsigned TRGSTRT4:1;
      unsigned TRGSTRT5:1;
      unsigned :6;
      unsigned TRGDIV0:1;
      unsigned TRGDIV1:1;
      unsigned TRGDIV2:1;
      unsigned TRGDIV3:1;
    };
  };
} TRGCON7BITS;
extern volatile TRGCON7BITS TRGCON7bits __attribute__((__sfr__));

#define STRIG7 STRIG7
extern volatile unsigned int  STRIG7 __attribute__((__sfr__));
__extension__ typedef struct tagSTRIG7BITS {
  union {
    struct {
      unsigned :3;
      unsigned STRGCMP:13;
    };
    struct {
      unsigned :3;
      unsigned STRGCMP0:1;
      unsigned STRGCMP1:1;
      unsigned STRGCMP2:1;
      unsigned STRGCMP3:1;
      unsigned STRGCMP4:1;
      unsigned STRGCMP5:1;
      unsigned STRGCMP6:1;
      unsigned STRGCMP7:1;
      unsigned STRGCMP8:1;
      unsigned STRGCMP9:1;
      unsigned STRGCMP10:1;
      unsigned STRGCMP11:1;
      unsigned STRGCMP12:1;
    };
  };
} STRIG7BITS;
extern volatile STRIG7BITS STRIG7bits __attribute__((__sfr__));

#define PWMCAP7 PWMCAP7
extern volatile unsigned int  PWMCAP7 __attribute__((__sfr__));
#define LEBCON7 LEBCON7
extern volatile unsigned int  LEBCON7 __attribute__((__sfr__));
typedef struct tagLEBCON7BITS {
  unsigned BPLL:1;
  unsigned BPLH:1;
  unsigned BPHL:1;
  unsigned BPHH:1;
  unsigned BCL:1;
  unsigned BCH:1;
  unsigned :4;
  unsigned CLLEBEN:1;
  unsigned FLTLEBEN:1;
  unsigned PLF:1;
  unsigned PLR:1;
  unsigned PHF:1;
  unsigned PHR:1;
} LEBCON7BITS;
extern volatile LEBCON7BITS LEBCON7bits __attribute__((__sfr__));

#define LEBDLY7 LEBDLY7
extern volatile unsigned int  LEBDLY7 __attribute__((__sfr__));
__extension__ typedef struct tagLEBDLY7BITS {
  union {
    struct {
      unsigned :3;
      unsigned LEB:9;
    };
    struct {
      unsigned :3;
      unsigned LEB0:1;
      unsigned LEB1:1;
      unsigned LEB2:1;
      unsigned LEB3:1;
      unsigned LEB4:1;
      unsigned LEB5:1;
      unsigned LEB6:1;
      unsigned LEB7:1;
      unsigned LEB8:1;
    };
  };
} LEBDLY7BITS;
extern volatile LEBDLY7BITS LEBDLY7bits __attribute__((__sfr__));

#define AUXCON7 AUXCON7
extern volatile unsigned int  AUXCON7 __attribute__((__sfr__));
__extension__ typedef struct tagAUXCON7BITS {
  union {
    struct {
      unsigned CHOPLEN:1;
      unsigned CHOPHEN:1;
      unsigned CHOPSEL:4;
      unsigned :2;
      unsigned BLANKSEL:4;
      unsigned :2;
      unsigned HRDDIS:1;
      unsigned HRPDIS:1;
    };
    struct {
      unsigned :2;
      unsigned CHOPSEL0:1;
      unsigned CHOPSEL1:1;
      unsigned CHOPSEL2:1;
      unsigned CHOPSEL3:1;
      unsigned :2;
      unsigned BLANKSEL0:1;
      unsigned BLANKSEL1:1;
      unsigned BLANKSEL2:1;
      unsigned BLANKSEL3:1;
    };
  };
} AUXCON7BITS;
extern volatile AUXCON7BITS AUXCON7bits __attribute__((__sfr__));

#define PWMCON8 PWMCON8
extern volatile unsigned int  PWMCON8 __attribute__((__sfr__));
__extension__ typedef struct tagPWMCON8BITS {
  union {
    struct {
      unsigned IUE:1;
      unsigned XPRES:1;
      unsigned CAM:1;
      unsigned MTBS:1;
      unsigned :1;
      unsigned DTCP:1;
      unsigned DTC:2;
      unsigned MDCS:1;
      unsigned ITB:1;
      unsigned TRGIEN:1;
      unsigned CLIEN:1;
      unsigned FLTIEN:1;
      unsigned TRGSTAT:1;
      unsigned CLSTAT:1;
      unsigned FLTSTAT:1;
    };
    struct {
      unsigned :6;
      unsigned DTC0:1;
      unsigned DTC1:1;
    };
  };
} PWMCON8BITS;
extern volatile PWMCON8BITS PWMCON8bits __attribute__((__sfr__));

#define IOCON8 IOCON8
extern volatile unsigned int  IOCON8 __attribute__((__sfr__));
__extension__ typedef struct tagIOCON8BITS {
  union {
    struct {
      unsigned OSYNC:1;
      unsigned SWAP:1;
      unsigned CLDAT:2;
      unsigned FLTDAT:2;
      unsigned OVRDAT:2;
      unsigned OVRENL:1;
      unsigned OVRENH:1;
      unsigned PMOD:2;
      unsigned POLL:1;
      unsigned POLH:1;
      unsigned PENL:1;
      unsigned PENH:1;
    };
    struct {
      unsigned :2;
      unsigned CLDAT0:1;
      unsigned CLDAT1:1;
      unsigned FLTDAT0:1;
      unsigned FLTDAT1:1;
      unsigned OVRDAT0:1;
      unsigned OVRDAT1:1;
      unsigned :2;
      unsigned PMOD0:1;
      unsigned PMOD1:1;
    };
  };
} IOCON8BITS;
extern volatile IOCON8BITS IOCON8bits __attribute__((__sfr__));

#define FCLCON8 FCLCON8
extern volatile unsigned int  FCLCON8 __attribute__((__sfr__));
__extension__ typedef struct tagFCLCON8BITS {
  union {
    struct {
      unsigned FLTMOD:2;
      unsigned FLTPOL:1;
      unsigned FLTSRC:5;
      unsigned CLMOD:1;
      unsigned CLPOL:1;
      unsigned CLSRC:5;
      unsigned IFLTMOD:1;
    };
    struct {
      unsigned FLTMOD0:1;
      unsigned FLTMOD1:1;
      unsigned :1;
      unsigned FLTSRC0:1;
      unsigned FLTSRC1:1;
      unsigned FLTSRC2:1;
      unsigned FLTSRC3:1;
      unsigned FLTSRC4:1;
      unsigned :2;
      unsigned CLSRC0:1;
      unsigned CLSRC1:1;
      unsigned CLSRC2:1;
      unsigned CLSRC3:1;
      unsigned CLSRC4:1;
    };
  };
} FCLCON8BITS;
extern volatile FCLCON8BITS FCLCON8bits __attribute__((__sfr__));

#define PDC8 PDC8
extern volatile unsigned int  PDC8 __attribute__((__sfr__));
#define PHASE8 PHASE8
extern volatile unsigned int  PHASE8 __attribute__((__sfr__));
#define DTR8 DTR8
extern volatile unsigned int  DTR8 __attribute__((__sfr__));
#define ALTDTR8 ALTDTR8
extern volatile unsigned int  ALTDTR8 __attribute__((__sfr__));
#define SDC8 SDC8
extern volatile unsigned int  SDC8 __attribute__((__sfr__));
#define SPHASE8 SPHASE8
extern volatile unsigned int  SPHASE8 __attribute__((__sfr__));
#define TRIG8 TRIG8
extern volatile unsigned int  TRIG8 __attribute__((__sfr__));
__extension__ typedef struct tagTRIG8BITS {
  union {
    struct {
      unsigned :3;
      unsigned TRGCMP:13;
    };
    struct {
      unsigned :3;
      unsigned TRGCMP0:1;
      unsigned TRGCMP1:1;
      unsigned TRGCMP2:1;
      unsigned TRGCMP3:1;
      unsigned TRGCMP4:1;
      unsigned TRGCMP5:1;
      unsigned TRGCMP6:1;
      unsigned TRGCMP7:1;
      unsigned TRGCMP8:1;
      unsigned TRGCMP9:1;
      unsigned TRGCMP10:1;
      unsigned TRGCMP11:1;
      unsigned TRGCMP12:1;
    };
  };
} TRIG8BITS;
extern volatile TRIG8BITS TRIG8bits __attribute__((__sfr__));

