Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ64GS608.h
#define _C1RXF4EID_EID3_POSITION                 0x00000003
#define _C1RXF4EID_EID3_MASK                     0x00000008
#define _C1RXF4EID_EID3_LENGTH                   0x00000001

#define _C1RXF4EID_EID4_POSITION                 0x00000004
#define _C1RXF4EID_EID4_MASK                     0x00000010
#define _C1RXF4EID_EID4_LENGTH                   0x00000001

#define _C1RXF4EID_EID5_POSITION                 0x00000005
#define _C1RXF4EID_EID5_MASK                     0x00000020
#define _C1RXF4EID_EID5_LENGTH                   0x00000001

#define _C1RXF4EID_EID6_POSITION                 0x00000006
#define _C1RXF4EID_EID6_MASK                     0x00000040
#define _C1RXF4EID_EID6_LENGTH                   0x00000001

#define _C1RXF4EID_EID7_POSITION                 0x00000007
#define _C1RXF4EID_EID7_MASK                     0x00000080
#define _C1RXF4EID_EID7_LENGTH                   0x00000001

#define _C1RXF4EID_EID8_POSITION                 0x00000008
#define _C1RXF4EID_EID8_MASK                     0x00000100
#define _C1RXF4EID_EID8_LENGTH                   0x00000001

#define _C1RXF4EID_EID9_POSITION                 0x00000009
#define _C1RXF4EID_EID9_MASK                     0x00000200
#define _C1RXF4EID_EID9_LENGTH                   0x00000001

#define _C1RXF4EID_EID10_POSITION                0x0000000A
#define _C1RXF4EID_EID10_MASK                    0x00000400
#define _C1RXF4EID_EID10_LENGTH                  0x00000001

#define _C1RXF4EID_EID11_POSITION                0x0000000B
#define _C1RXF4EID_EID11_MASK                    0x00000800
#define _C1RXF4EID_EID11_LENGTH                  0x00000001

#define _C1RXF4EID_EID12_POSITION                0x0000000C
#define _C1RXF4EID_EID12_MASK                    0x00001000
#define _C1RXF4EID_EID12_LENGTH                  0x00000001

#define _C1RXF4EID_EID13_POSITION                0x0000000D
#define _C1RXF4EID_EID13_MASK                    0x00002000
#define _C1RXF4EID_EID13_LENGTH                  0x00000001

#define _C1RXF4EID_EID14_POSITION                0x0000000E
#define _C1RXF4EID_EID14_MASK                    0x00004000
#define _C1RXF4EID_EID14_LENGTH                  0x00000001

#define _C1RXF4EID_EID15_POSITION                0x0000000F
#define _C1RXF4EID_EID15_MASK                    0x00008000
#define _C1RXF4EID_EID15_LENGTH                  0x00000001

#define _C1RXF4EID_EID_POSITION                  0x00000000
#define _C1RXF4EID_EID_MASK                      0x0000FFFF
#define _C1RXF4EID_EID_LENGTH                    0x00000010

#define _C1RXF5SID_EID16_POSITION                0x00000000
#define _C1RXF5SID_EID16_MASK                    0x00000001
#define _C1RXF5SID_EID16_LENGTH                  0x00000001

#define _C1RXF5SID_EID17_POSITION                0x00000001
#define _C1RXF5SID_EID17_MASK                    0x00000002
#define _C1RXF5SID_EID17_LENGTH                  0x00000001

#define _C1RXF5SID_EXIDE_POSITION                0x00000003
#define _C1RXF5SID_EXIDE_MASK                    0x00000008
#define _C1RXF5SID_EXIDE_LENGTH                  0x00000001

#define _C1RXF5SID_SID0_POSITION                 0x00000005
#define _C1RXF5SID_SID0_MASK                     0x00000020
#define _C1RXF5SID_SID0_LENGTH                   0x00000001

#define _C1RXF5SID_SID1_POSITION                 0x00000006
#define _C1RXF5SID_SID1_MASK                     0x00000040
#define _C1RXF5SID_SID1_LENGTH                   0x00000001

#define _C1RXF5SID_SID2_POSITION                 0x00000007
#define _C1RXF5SID_SID2_MASK                     0x00000080
#define _C1RXF5SID_SID2_LENGTH                   0x00000001

#define _C1RXF5SID_SID3_POSITION                 0x00000008
#define _C1RXF5SID_SID3_MASK                     0x00000100
#define _C1RXF5SID_SID3_LENGTH                   0x00000001

#define _C1RXF5SID_SID4_POSITION                 0x00000009
#define _C1RXF5SID_SID4_MASK                     0x00000200
#define _C1RXF5SID_SID4_LENGTH                   0x00000001

#define _C1RXF5SID_SID5_POSITION                 0x0000000A
#define _C1RXF5SID_SID5_MASK                     0x00000400
#define _C1RXF5SID_SID5_LENGTH                   0x00000001

#define _C1RXF5SID_SID6_POSITION                 0x0000000B
#define _C1RXF5SID_SID6_MASK                     0x00000800
#define _C1RXF5SID_SID6_LENGTH                   0x00000001

#define _C1RXF5SID_SID7_POSITION                 0x0000000C
#define _C1RXF5SID_SID7_MASK                     0x00001000
#define _C1RXF5SID_SID7_LENGTH                   0x00000001

#define _C1RXF5SID_SID8_POSITION                 0x0000000D
#define _C1RXF5SID_SID8_MASK                     0x00002000
#define _C1RXF5SID_SID8_LENGTH                   0x00000001

#define _C1RXF5SID_SID9_POSITION                 0x0000000E
#define _C1RXF5SID_SID9_MASK                     0x00004000
#define _C1RXF5SID_SID9_LENGTH                   0x00000001

#define _C1RXF5SID_SID10_POSITION                0x0000000F
#define _C1RXF5SID_SID10_MASK                    0x00008000
#define _C1RXF5SID_SID10_LENGTH                  0x00000001

#define _C1RXF5SID_EID_POSITION                  0x00000000
#define _C1RXF5SID_EID_MASK                      0x00000003
#define _C1RXF5SID_EID_LENGTH                    0x00000002

#define _C1RXF5SID_SID_POSITION                  0x00000005
#define _C1RXF5SID_SID_MASK                      0x0000FFE0
#define _C1RXF5SID_SID_LENGTH                    0x0000000B

#define _C1RXF5EID_EID0_POSITION                 0x00000000
#define _C1RXF5EID_EID0_MASK                     0x00000001
#define _C1RXF5EID_EID0_LENGTH                   0x00000001

#define _C1RXF5EID_EID1_POSITION                 0x00000001
#define _C1RXF5EID_EID1_MASK                     0x00000002
#define _C1RXF5EID_EID1_LENGTH                   0x00000001

#define _C1RXF5EID_EID2_POSITION                 0x00000002
#define _C1RXF5EID_EID2_MASK                     0x00000004
#define _C1RXF5EID_EID2_LENGTH                   0x00000001

#define _C1RXF5EID_EID3_POSITION                 0x00000003
#define _C1RXF5EID_EID3_MASK                     0x00000008
#define _C1RXF5EID_EID3_LENGTH                   0x00000001

