Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ64GS608.h
#define _CLKDIV_PLLPRE0_POSITION                 0x00000000
#define _CLKDIV_PLLPRE0_MASK                     0x00000001
#define _CLKDIV_PLLPRE0_LENGTH                   0x00000001

#define _CLKDIV_PLLPRE1_POSITION                 0x00000001
#define _CLKDIV_PLLPRE1_MASK                     0x00000002
#define _CLKDIV_PLLPRE1_LENGTH                   0x00000001

#define _CLKDIV_PLLPRE2_POSITION                 0x00000002
#define _CLKDIV_PLLPRE2_MASK                     0x00000004
#define _CLKDIV_PLLPRE2_LENGTH                   0x00000001

#define _CLKDIV_PLLPRE3_POSITION                 0x00000003
#define _CLKDIV_PLLPRE3_MASK                     0x00000008
#define _CLKDIV_PLLPRE3_LENGTH                   0x00000001

#define _CLKDIV_PLLPRE4_POSITION                 0x00000004
#define _CLKDIV_PLLPRE4_MASK                     0x00000010
#define _CLKDIV_PLLPRE4_LENGTH                   0x00000001

#define _CLKDIV_PLLPOST0_POSITION                0x00000006
#define _CLKDIV_PLLPOST0_MASK                    0x00000040
#define _CLKDIV_PLLPOST0_LENGTH                  0x00000001

#define _CLKDIV_PLLPOST1_POSITION                0x00000007
#define _CLKDIV_PLLPOST1_MASK                    0x00000080
#define _CLKDIV_PLLPOST1_LENGTH                  0x00000001

#define _CLKDIV_FRCDIV0_POSITION                 0x00000008
#define _CLKDIV_FRCDIV0_MASK                     0x00000100
#define _CLKDIV_FRCDIV0_LENGTH                   0x00000001

#define _CLKDIV_FRCDIV1_POSITION                 0x00000009
#define _CLKDIV_FRCDIV1_MASK                     0x00000200
#define _CLKDIV_FRCDIV1_LENGTH                   0x00000001

#define _CLKDIV_FRCDIV2_POSITION                 0x0000000A
#define _CLKDIV_FRCDIV2_MASK                     0x00000400
#define _CLKDIV_FRCDIV2_LENGTH                   0x00000001

#define _CLKDIV_DOZE0_POSITION                   0x0000000C
#define _CLKDIV_DOZE0_MASK                       0x00001000
#define _CLKDIV_DOZE0_LENGTH                     0x00000001

#define _CLKDIV_DOZE1_POSITION                   0x0000000D
#define _CLKDIV_DOZE1_MASK                       0x00002000
#define _CLKDIV_DOZE1_LENGTH                     0x00000001

#define _CLKDIV_DOZE2_POSITION                   0x0000000E
#define _CLKDIV_DOZE2_MASK                       0x00004000
#define _CLKDIV_DOZE2_LENGTH                     0x00000001

#define _PLLFBD_PLLDIV_POSITION                  0x00000000
#define _PLLFBD_PLLDIV_MASK                      0x000001FF
#define _PLLFBD_PLLDIV_LENGTH                    0x00000009

#define _PLLFBD_PLLDIV0_POSITION                 0x00000000
#define _PLLFBD_PLLDIV0_MASK                     0x00000001
#define _PLLFBD_PLLDIV0_LENGTH                   0x00000001

#define _PLLFBD_PLLDIV1_POSITION                 0x00000001
#define _PLLFBD_PLLDIV1_MASK                     0x00000002
#define _PLLFBD_PLLDIV1_LENGTH                   0x00000001

#define _PLLFBD_PLLDIV2_POSITION                 0x00000002
#define _PLLFBD_PLLDIV2_MASK                     0x00000004
#define _PLLFBD_PLLDIV2_LENGTH                   0x00000001

#define _PLLFBD_PLLDIV3_POSITION                 0x00000003
#define _PLLFBD_PLLDIV3_MASK                     0x00000008
#define _PLLFBD_PLLDIV3_LENGTH                   0x00000001

#define _PLLFBD_PLLDIV4_POSITION                 0x00000004
#define _PLLFBD_PLLDIV4_MASK                     0x00000010
#define _PLLFBD_PLLDIV4_LENGTH                   0x00000001

#define _PLLFBD_PLLDIV5_POSITION                 0x00000005
#define _PLLFBD_PLLDIV5_MASK                     0x00000020
#define _PLLFBD_PLLDIV5_LENGTH                   0x00000001

#define _PLLFBD_PLLDIV6_POSITION                 0x00000006
#define _PLLFBD_PLLDIV6_MASK                     0x00000040
#define _PLLFBD_PLLDIV6_LENGTH                   0x00000001

#define _PLLFBD_PLLDIV7_POSITION                 0x00000007
#define _PLLFBD_PLLDIV7_MASK                     0x00000080
#define _PLLFBD_PLLDIV7_LENGTH                   0x00000001

#define _PLLFBD_PLLDIV8_POSITION                 0x00000008
#define _PLLFBD_PLLDIV8_MASK                     0x00000100
#define _PLLFBD_PLLDIV8_LENGTH                   0x00000001

#define _OSCTUN_TUN_POSITION                     0x00000000
#define _OSCTUN_TUN_MASK                         0x0000003F
#define _OSCTUN_TUN_LENGTH                       0x00000006

#define _OSCTUN_TUN0_POSITION                    0x00000000
#define _OSCTUN_TUN0_MASK                        0x00000001
#define _OSCTUN_TUN0_LENGTH                      0x00000001

#define _OSCTUN_TUN1_POSITION                    0x00000001
#define _OSCTUN_TUN1_MASK                        0x00000002
#define _OSCTUN_TUN1_LENGTH                      0x00000001

#define _OSCTUN_TUN2_POSITION                    0x00000002
#define _OSCTUN_TUN2_MASK                        0x00000004
#define _OSCTUN_TUN2_LENGTH                      0x00000001

#define _OSCTUN_TUN3_POSITION                    0x00000003
#define _OSCTUN_TUN3_MASK                        0x00000008
#define _OSCTUN_TUN3_LENGTH                      0x00000001

#define _OSCTUN_TSEQ10_POSITION                  0x00000004
#define _OSCTUN_TSEQ10_MASK                      0x00000010
#define _OSCTUN_TSEQ10_LENGTH                    0x00000001

#define _OSCTUN_TSEQ11_POSITION                  0x00000005
#define _OSCTUN_TSEQ11_MASK                      0x00000020
#define _OSCTUN_TSEQ11_LENGTH                    0x00000001

#define _OSCTUN_TSEQ12_POSITION                  0x00000006
#define _OSCTUN_TSEQ12_MASK                      0x00000040
#define _OSCTUN_TSEQ12_LENGTH                    0x00000001

#define _OSCTUN_TSEQ13_POSITION                  0x00000007
#define _OSCTUN_TSEQ13_MASK                      0x00000080
#define _OSCTUN_TSEQ13_LENGTH                    0x00000001

#define _OSCTUN_TSEQ20_POSITION                  0x00000008
#define _OSCTUN_TSEQ20_MASK                      0x00000100
#define _OSCTUN_TSEQ20_LENGTH                    0x00000001

#define _OSCTUN_TSEQ21_POSITION                  0x00000009
#define _OSCTUN_TSEQ21_MASK                      0x00000200
#define _OSCTUN_TSEQ21_LENGTH                    0x00000001

#define _OSCTUN_TSEQ22_POSITION                  0x0000000A
#define _OSCTUN_TSEQ22_MASK                      0x00000400
#define _OSCTUN_TSEQ22_LENGTH                    0x00000001

#define _OSCTUN_TSEQ23_POSITION                  0x0000000B
#define _OSCTUN_TSEQ23_MASK                      0x00000800
#define _OSCTUN_TSEQ23_LENGTH                    0x00000001

#define _OSCTUN_TSEQ30_POSITION                  0x0000000C
#define _OSCTUN_TSEQ30_MASK                      0x00001000
#define _OSCTUN_TSEQ30_LENGTH                    0x00000001

#define _OSCTUN_TSEQ31_POSITION                  0x0000000D
#define _OSCTUN_TSEQ31_MASK                      0x00002000
#define _OSCTUN_TSEQ31_LENGTH                    0x00000001

#define _OSCTUN_TSEQ32_POSITION                  0x0000000E
#define _OSCTUN_TSEQ32_MASK                      0x00004000
#define _OSCTUN_TSEQ32_LENGTH                    0x00000001

#define _OSCTUN_TSEQ33_POSITION                  0x0000000F
#define _OSCTUN_TSEQ33_MASK                      0x00008000
#define _OSCTUN_TSEQ33_LENGTH                    0x00000001

#define _OSCTUN2_TSEQ40_POSITION                 0x00000000
#define _OSCTUN2_TSEQ40_MASK                     0x00000001
#define _OSCTUN2_TSEQ40_LENGTH                   0x00000001

